[
  {
    "id": 1,
    "title": "Chocolate Cake",
    "description": "A rich and decadent chocolate cake that's perfect for special occasions.",
    "image": "chocolate-cake",
    "ingredients": [
      "2 cups all-purpose flour",
      "3/4 cup unsweetened cocoa powder",
      "1 1/2 teaspoons baking soda",
      "1 1/2 teaspoons baking powder",
      "1/2 teaspoon salt",
      "1 cup unsalted butter, softened",
      "2 cups granulated sugar",
      "4 large eggs, room temperature",
      "2 teaspoons vanilla extract",
      "1 1/2 cups whole milk, room temperature"
    ],
    "steps": [
      "Preheat the oven to 350 degrees F (175 degrees C). Grease and flour two 9-inch cake pans.",
      "In a medium bowl, whisk together the flour, cocoa powder, baking soda, baking powder, and salt.",
      "In a large bowl, cream together the butter and sugar until light and fluffy. Beat in the eggs, one at a time, then stir in the vanilla.",
      "Gradually mix in the dry ingredients, alternating with the milk, until just blended. Pour the batter evenly into the prepared pans.",
      "Bake for 30 to 35 minutes, or until a toothpick inserted into the center of the cakes comes out clean. Allow to cool completely before frosting and serving."
    ]
  },
  {
    "id": 2,
    "title": "Vanilla Bean Ice Cream",
    "description": "A classic homemade ice cream flavored with real vanilla beans.",
    "image": "vanilla_ice_cream",
    "ingredients": [
      "2 cups heavy cream",
      "1 cup whole milk",
      "3/4 cup granulated sugar",
      "1/4 teaspoon salt",
      "1 vanilla bean, split lengthwise and scraped",
      "6 large egg yolks",
      "1 teaspoon pure vanilla extract"
    ],
    "steps": [
      "In a medium saucepan, heat the milk, cream, sugar, and salt over medium heat until the sugar has dissolved.",
      "Cut the vanilla bean in half lengthwise, then scrape out the seeds and add them to the milk mixture. Drop in the vanilla bean pod.",
      "In a medium bowl, whisk together the egg yolks. Gradually pour in the hot milk mixture, whisking constantly, then pour the mixture back into the saucepan.",
      "Cook over low heat, stirring constantly, until the mixture thickens and coats the back of a spoon, about 5 minutes. Remove from heat and strain into a bowl.",
      "Stir in the vanilla extract. Cover and chill in the refrigerator for at least 4 hours, or overnight.",
      "Pour the mixture into an ice cream maker and freeze according to the manufacturer's instructions. Transfer to a container and freeze for at least 2 hours before serving."
    ]
  },
  {
    "id": 3,
    "title": "Apple Pie",
    "description": "A classic dessert featuring tender apples baked in a flaky crust.",
    "image": "apple_pie",
    "ingredients": [
      "1 recipe double crust pie dough",
      "2 1/2 pounds Granny Smith apples, peeled, cored, and sliced",
      "1/2 cup granulated sugar",
      "1/4 cup all-purpose flour",
      "1 teaspoon ground cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1/4 teaspoon salt"
    ],
    "steps": [
          "Preheat the oven to 375 degrees F (190 degrees C).",
          "In a large bowl, toss together the apples, sugar, flour, cinnamon, nutmeg, and salt.",
          "Roll out one of the pie crusts and place it into a 9-inch pie dish. Pour in the apple filling.",
          "Roll out the second pie crust and cut into strips. Weave the strips over the top of the pie to create a lattice pattern.",
          "Bake for 45 to 50 minutes, or until the crust is golden brown and the filling is bubbling. Allow to cool for at least 30 minutes before serving."
    ]
  },
  {    "id": 4,    "title": "Lemon Bars",    "description": "Tangy and sweet lemon bars with a buttery shortbread crust.",    "image": "lemon-bars",    "ingredients": [      "1 cup unsalted butter, softened",      "1/2 cup granulated sugar",      "2 cups all-purpose flour",      "4 large eggs",      "1 1/2 cups granulated sugar",      "1/4 cup all-purpose flour",      "1/2 cup fresh lemon juice",      "1 tablespoon grated lemon zest",      "powdered sugar for dusting"    ],
      "steps": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking pan.",
        "In a large bowl, cream together the butter and sugar until light and fluffy. Mix in 2 cups of flour until well blended.",
        "Press the mixture evenly into the prepared pan. Bake for 20 minutes or until golden brown.",
        "In another bowl, whisk together the eggs, 1 1/2 cups of sugar, and 1/4 cup of flour. Stir in the lemon juice and zest.",
        "Pour the lemon mixture over the baked crust and return to the oven. Bake for an additional 25 minutes, or until set.",
        "Allow to cool completely before dusting with powdered sugar and cutting into bars."
      ]
  },
  {    "id": 5,    "title": "Apple Crisp",    "description": "Warm and comforting apple crisp with a crispy oat and cinnamon topping.",    "image": "apple-crisp",    "ingredients": [      "6 cups sliced apples",      "1/2 cup all-purpose flour",      "1/2 cup rolled oats",      "1/2 cup brown sugar",      "1/2 teaspoon ground cinnamon",      "1/2 cup unsalted butter, melted"    ],
      "steps": [
        "Preheat the oven to 375 degrees F (190 degrees C). Grease a 9x13 inch baking dish.",
        "Arrange the sliced apples in the prepared dish.",
        "In a bowl, mix together the flour, oats, brown sugar, and cinnamon. Stir in the melted butter until the mixture is crumbly.",
        "Sprinkle the crumble mixture over the apples in the dish.",
        "Bake for 30-40 minutes or until the topping is golden brown and the apples are tender.",
        "Allow to cool for a few minutes before serving warm with vanilla ice cream or whipped cream."
      ]
    },
  {
      "id": 6,
      "title": "Cheesecake Bars",
      "description": "Creamy and indulgent cheesecake bars with a graham cracker crust and fresh berry topping.",
      "image": "cheesecake-bars",
      "ingredients": [
        "2 cups graham cracker crumbs",
        "1/2 cup unsalted butter, melted",
        "1/4 cup granulated sugar",
        "16 oz cream cheese, softened",
        "1 cup granulated sugar",
        "1 teaspoon vanilla extract",
        "4 large eggs",
        "1/2 cup fresh berries for topping"
      ],
      "steps": [
        "Preheat the oven to 325 degrees F (160 degrees C). Grease a 9x13 inch baking dish.",
        "In a medium bowl, mix together the graham cracker crumbs, melted butter, and 1/4 cup sugar. Press the mixture into the bottom of the prepared baking dish.",
        "In a large bowl, beat the cream cheese until smooth. Gradually add in the 1 cup of sugar and vanilla extract, beating until well combined.",
        "Add in the eggs one at a time, beating well after each addition. Pour the mixture over the crust in the baking dish.",
        "Bake for 35-40 minutes or until the edges are lightly golden and the center is set. Cool the bars completely in the pan before refrigerating for at least 2 hours or overnight.",
        "Top the bars with fresh berries before serving."
        ]
        },
        {
        "id": 7,
        "title": "Banana Bread",
        "description": "A classic and comforting loaf of banana bread, perfect for breakfast or a snack.",
        "image": "banana-bread",
        "ingredients": [
        "2 cups all-purpose flour",
        "1 teaspoon baking soda",
        "1/4 teaspoon salt",
        "1/2 cup unsalted butter, softened",
        "3/4 cup brown sugar",
        "2 large eggs",
        "3 ripe bananas, mashed",
        "1 teaspoon vanilla extract"
        ],
        "steps": [
        "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x5 inch loaf pan.",
        "In a medium bowl, whisk together the flour, baking soda, and salt.",
        "In a large bowl, cream together the butter and brown sugar until light and fluffy. Beat in the eggs, one at a time, then stir in the mashed bananas and vanilla.",
        "Gradually mix in the dry ingredients until just blended. Pour the batter into the prepared loaf pan.",
        "Bake for 50 to 60 minutes, or until a toothpick inserted into the center of the bread comes out clean. Cool the bread in the pan for 10 minutes before removing to a wire rack to cool completely."
        ]
        }
]
